<?php

declare(strict_types=1);

namespace Tests\Models\Parser;

use App\Models\Parser\AlbatrosTimingParser;
use Iterator;

final class AlbatrosTimingParserTest extends AbstractParser
{
    public static function dataProvider(): Iterator
    {
        yield [
            '2026/20260404.htm',
            248,
            [
                0 => [
                    'Стасевич',
                    'Игорь',
                    'OC "Silwan Liuks"',
                    1990,
                    'КМС',
                    171,
                    '0:59:11',
                    1,
                    'II',
                    null,
                    false,
                    'М1',
                ],
                30 => [
                    'Лубник',
                    'Александр',
                    'OC "Silwan Liuks"',
                    1996,
                    'I',
                    117,
                    null,
                    null,
                    '-',
                    null,
                    false,
                    'М1',
                ],
                33 => [
                    'Голубкович',
                    'Игорь',
                    'Брест',
                    1984,
                    'III',
                    158,
                    null,
                    null,
                    '-',
                    null,
                    false,
                    'М1',
                ],
                215 => [
                    'Юзефович',
                    'Марта',
                    'Кобринский район',
                    2013,
                    'б/р',
                    5074,
                    '0:38:51',
                    1,
                    'IIю',
                    null,
                    false,
                    'Ж5',
                ],
            ],
        ];
        yield [
            '2026/20260919.htm',
            273,
            [
                0 => [
                    'Стасевич',
                    'Игорь',
                    'OC "Silwan Liuks"',
                    1990,
                    'КМС',
                    171,
                    '0:25:25',
                    1,
                    'II',
                    null,
                    false,
                    'М1',
                ],
                68 => [
                    'Горник',
                    'Макар',
                    'Санаторная школа',
                    2013,
                    'б/р',
                    4132,
                    null,
                    null,
                    '-',
                    null,
                    false,
                    'М3',
                ],
                238 => [
                    'Зинчук',
                    'Валерия',
                    'Областной лицей Брест',
                    2011,
                    'б/р',
                    5299,
                    null,
                    null,
                    '-',
                    null,
                    false,
                    'Ж4',
                ],
                272 => [
                    'Сакович',
                    'Дарья',
                    'Березовский район',
                    2016,
                    'б/р',
                    7160,
                    null,
                    null,
                    '-',
                    null,
                    false,
                    'Ж5',
                ],
            ],
        ];
        yield [
            '2026/20260718.htm',
            237,
            [
                0 => [
                    'Кузьмина',
                    'Екатерина',
                    'RUS Республика Крым',
                    2016,
                    'IIIю',
                    114,
                    '0:12:29',
                    1,
                    '-',
                    null,
                    false,
                    'Ж10',
                ],
                10 => [
                    'Бильдюкевич',
                    'Валерия',
                    'КО «Случь»',
                    2014,
                    'Iю',
                    19,
                    null,
                    null,
                    '-',
                    null,
                    false,
                    'Ж12',
                ],
                14 => [
                    'Атрошко',
                    'Карина',
                    'КСО «Березино»',
                    2012,
                    'IIю',
                    13,
                    null,
                    null,
                    '-',
                    null,
                    false,
                    'Ж14',
                ],
                161 => [
                    'Кульгавый',
                    'Иван',
                    'СК «Камволь»',
                    2004,
                    'КМС',
                    116,
                    null,
                    null,
                    '-',
                    null,
                    false,
                    'М21',
                ],
                236 => [
                    'Долмат',
                    'Александра',
                    'Палива',
                    2003,
                    'б/р',
                    63,
                    null,
                    null,
                    '-',
                    null,
                    false,
                    'Open2',
                ],
            ],
        ];
        yield [
            '2026/20260412.htm',
            102,
            [
                0 => [
                    'Апетенок',
                    'Дмитрий',
                    'КО "Ультра"',
                    1983,
                    'б/р',
                    126,
                    '0:29:26',
                    1,
                    null,
                    null,
                ],
                57 => [
                    'Лазарьков',
                    'Артур',
                    'Родничок',
                    2011,
                    'б/р',
                    122,
                    null,
                    null,
                    null,
                    null,
                ],
            ],
        ];
        yield [
            '2025/251018.htm',
            376,
            [
                17 => [
                    'Ярошевич',
                    'Ева',
                    'Клецкий р-н',
                    2015,
                    'б/р',
                    218,
                    null,
                    null,
                    '-',
                    null,
                ],
            ]
        ];
        yield [
            '2024/20240303.htm',
            352,
            [
                0 => [
                    'Амеличкин',
                    'Василий',
                    'Фоксоринг',
                    1986,
                    'I',
                    10,
                    '0:22:17',
                    1,
                    'II',
                    null,
                ],
            ]
        ];
        yield [
            '2024/20242704.htm',
            213,
            [
                0 => [
                    'Макеенко',
                    'Михаил',
                    'ГТК « Цитадель»',
                    1989,
                    'II',
                    51,
                    '0:35:20',
                    1,
                    'II',
                    null,
                ],
            ]
        ];
        yield [
            '2020/200905_perv_00_.htm',
            118,
            [
                7 => [
                    'Сукневич',
                    'Миша',
                    'КСО «Немига-Норд»',
                    2010,
                    'б/р',
                    151,
                    '0:35:43',
                    8,
                    '-',
                    null,
                ],
                20 => [
                    'Лабкович',
                    'Иван',
                    'Минская обл.',
                    2007,
                    'Iю',
                    444,
                    '0:31:24',
                    2,
                    'IIю',
                    100
                ],
            ]
        ];
        yield [
            '2020/20201024_r.htm',
            232,
            [
                2 => [
                    'Катлерова',
                    'Надежда',
                    'КО «БГУ»',
                    1981,
                    'II',
                    46,
                    null,
                    null,
                    '-',
                    null,
                ],
                3 => [
                    'Сукневич',
                    'София',
                    'КСО «Немига-Норд»',
                    2010,
                    'Iю',
                    146,
                    '0:24:22',
                    1,
                    '-',
                    null
                ],
                5 => [
                    'Саванович',
                    'Мария',
                    'КСО «Эридан»',
                    2011,
                    'б/р',
                    183,
                    '0:41:54',
                    null,
                    '-',
                    null,
                    true,
                ],
            ]
        ];
        yield [
            '2021/210306_res.htm',
            52,
            [
                0 => [
                    'Буякова',
                    'Оксана',
                    'КО «Сильван люкс»',
                    1990,
                    'МС',
                    9,
                    '1:28:04',
                    1,
                    'МС',
                    100,
                ],
                7 => [
                    'Языкова',
                    'Дарья',
                    'КСО «Немига-Норд»',
                    1993,
                    'МС',
                    2,
                    null,
                    null,
                    '-',
                    null
                ],
                13 => [
                    'Лисаченко',
                    'Ксения',
                    'Эврика',
                    2008,
                    'Iю',
                    19,
                    '1:06:57',
                    1,
                    '-',
                    null
                ],
                40 => [
                    'Лисаченко',
                    'Иван',
                    'МГТЭЦДиМ',
                    2005,
                    'Iю',
                    57,
                    '0:44:45',
                    1,
                    null,
                    null
                ],
            ]
        ];
        yield [
            '2021/protocol_210522_komandnyy-chempionat_80865.htm',
            349,
            [
                232 => [
                    'Алексеенок',
                    'Алексей',
                    'КСО «Эридан»',
                    1988,
                    'МС',
                    383,
                    '0:42:34',
                    null,
                    '-',
                    null,
                    true,
                ],
            ]
        ];
        yield [
            '2022/221211_res.htm',
            88,
            [
                // 1 Савченко Яна   OC Silwan Liuks  2004 I  5125  0:58:02  1  -  119
                0 => [
                    'Савченко',        //lastname
                    'Яна',             //firstname
                    'OC Silwan Liuks', //club
                    2004,              //year
                    'I',               //rank
                    5125,              //runner_number
                    '0:58:02',         //time
                    1,                 //place
                    '-',               //complete_rank
                    119,               //points
                ],
                // 1 Лычков Игорь  СКО "Немига-Норд"  1983 МС  13  0:42:42  1  I  120
                34 => [
                    'Лычков',            //lastname
                    'Игорь',             //firstname
                    'СКО "Немига-Норд"', //club
                    1983,                //year
                    'МС',                //rank
                    13,                  //runner_number
                    '0:42:42',           //time
                    1,                   //place
                    'I',                 //complete_rank
                    120,                 //points
                ],
            ]
        ];
    }
    protected function getParser(): string
    {
        return AlbatrosTimingParser::class;
    }
}
