<?php
declare(strict_types=1);

namespace Tests\Models\Parser;

use App\Models\Parser\WinOrientHtmlParser;

class WinOrientParserTest extends AbstractParserTest
{
    public static function dataProvider(): array
    {
        return [
            [
                '2020/18072020.htm',
                219,
                [
                    0 => [
                        'Михалкин', //фамилия
                        'Игорь',    //имя
                        'Эридан',   //клуб
                        2008,       //год
                        null,       //разряд
                        141,        //номер
                        '00:27:39', //время
                        1,          //место
                        null,       //очки
                        null,       //выполненный разряд
                    ],
                    14 => [
                        'Голютов',
                        'Никита',
                        'Лагерь "Волобо"',
                        null,
                        null,
                        36,
                        null,
                        null,
                        null,
                        null,
                    ],
                    45 => [
                        'Языков',
                        'Юрий',
                        'КСО "Немига-Норд"',
                        1990,
                        'МСМК',
                        150,
                        '00:42:10',
                        5,
                        null,
                        null,
                    ],
                    46 => [
                        'Попов',
                        'Дмитрий',
                        'Эридан',
                        1999,
                        'КМС',
                        191,
                        '00:42:12',
                        6,
                        null,
                        null,
                    ],
                ]
            ],
            [
                '2019/protocol_190414_otkrytyy-kubok-g-grodno-2019_72884.htm',
                411,
                [
                    0 => [
                        'Мурашка', //фамилия
                        'Усяслаў', //имя
                        'СКО «Орион»', //клуб
                        2007, //год
                        'Iю', //разряд
                        435, //номер
                        '00:07:52', //время
                        1, //место
                        'IIю', //выполненный разряд
                        80, //очки
                    ],
                    50 => [
                        'Комаров',
                        'Максим',
                        'OK Kaliningrad RUS',
                        2005,
                        '',
                        311,
                        null,
                        0,
                        '-',
                        null,
                    ],
                ]
            ],
            [
                '2021/_210919_gp_res.htm',
                411,
                [
                    0 => [
                        'Катлерова', //фамилия
                        'Надежда',   //имя
                        'КО «БГУ»',  //клуб
                        1981,        //год
                        'б/р',       //разряд
                        9004,        //номер
                        '00:21:43',  //время
                        1,           //место
                        '-',         //выполненный разряд
                        null,        //очки
                    ],
                    72 => [
                        'Кравченко',
                        'Екатерина',
                        'КО «Случь»',
                        1976,
                        'б/р',
                        4058,
                        null,
                        null,
                        '-',
                        null,
                    ],
                    360 => [
                        'Пунько',
                        'Прохор',
                        'Брестская обл',
                        2009,
                        'IIю',
                        1261,
                        '00:07:51',
                        3,
                        'IIю',
                        null,
                    ],
                    371 => [
                        'Барановский',
                        'Павел',
                        'Гродненская обл',
                        2007,
                        'б/р',
                        1257,
                        '00:09:44',
                        null,
                        '-',
                        null,
                        true,
                    ],
                ]
            ],
            [
                '2021/211009_res.htm',
                166,
                [
                    0 => [
                        'Борзина', //фамилия
                        'Ульяна',   //имя
                        'Эридан 2',  //клуб
                        2012,        //год
                        'б/р',       //разряд
                        159,        //номер
                        '00:14:07',  //время
                        1,           //место
                        '-',         //выполненный разряд
                        null,        //очки
                    ],
                    6 => [
                        'Миронова',
                        'Анастасия',
                        'Эридан 1',
                        2013,
                        'б/р',
                        155,
                        null,
                        null,
                        '-',
                        null,
                    ],
                    146 => [
                        'Шавель',
                        'Ярослав',
                        'ДДиМ Новополоцка 4',
                        2006,
                        'б/р',
                        96,
                        null,
                        null,
                        '-',
                        null,
                    ],
                ]
            ]
        ];
    }
    protected function getParser(): string
    {
        return WinOrientHtmlParser::class;
    }
}
