<?php

return [
    'club' => [
        'name' => 'Клюб',
    ],
    'persons' => [
        'title' => 'Члены федэрацыі',
    ],
    'navbar' => [
        'clubs' => 'Клюбы',
        'persons' => 'Члены федэрацыі',
        'competitions' => 'Спаборніцтвы',
        'no-ident' => 'Не ідэнтыфікаваныя запісы пратаколаў',
    ],
    'ident' => [
        'edit' => [
            'title' => 'Звязаць выник и спартоўца',
        ]
    ],
    'common' => [
        'name' => 'Імя',
        'lastname' => 'Прозвішча',
        'birthday' => 'Дата нараджэння',
    ],
    'protocol' => 'Пратакол',
    'protocol-hint' => 'Если не добавлять файл, то обновления участников не будет',
    'lang' => [
        'ru' => 'Рус',
        'by' => 'Бел',
    ]
];
