<?php

return [
    'club' => [
        'name' => 'Клюб',
        'persons_count' => 'Колькасць членаў',
    ],
    'persons' => [
        'title' => 'Члены федэрацыі',
    ],
    'navbar' => [
        'clubs' => 'Клюбы',
        'persons' => 'Члены федэрацыі',
        'competitions' => 'Спаборніцтвы',
        'no-ident' => 'Не ідэнтыфікаваныя запісы пратаколаў',
        'flags' => 'Меткі этапаў',
    ],
    'ident' => [
        'edit' => [
            'title' => 'Звязаць выник и спартоўца',
        ]
    ],
    'common' => [
        'name' => 'Імя',
        'lastname' => 'Прозвішча',
        'birthday' => 'Дата нараджэння',
        'create' => 'Захаваць',
        'update' => 'Абнавіць',
        'new' => 'Дадаць',
        'delete' => 'Выдаліць',
        'cancel' => 'Адмена',
        'add_flags' => 'Рэдагаваць меткі',
        'edit_event' => 'Рэдагаванне этапу',
        'title' => 'Назва',
        'description' => 'Апісанне',
        'back' => 'Назад',
        'date' => 'Дата',
        'dates' => 'Даты',
        'competitors' => 'Колькасць удзельнікаў',
        'edit' => 'Рэдагаваць',
        'group' => 'Группа',
        'result' => 'Вынік',
        'place' => 'Месца',
        'points' => 'Ачкі',
        'complete_rank' => 'Выкананы разрад',
        'search' => 'Пошук',
    ],
    'competition' => 'Спаборніцтвы',
    'add_competition' => 'Дадаць спаборніцтвы',
    'protocol' => 'Пратакол',
    'protocol-hint' => 'Если не добавлять файл, то обновления участников не будет',
    'lang' => [
        'ru' => 'Рус',
        'by' => 'Бел',
    ],
    'events' => [
        'flags' => 'Меткі'
    ],
    'flags' => [
        'add_flags_title' => 'Редагаваць меткі этапа',
        'name' => 'Назва',
        'color' => 'Колер',
        'create' => [
            'title' => 'Дабаўленне новай меткі этапа',
        ],
        'edit' => [
            'title' => 'Рэдагаванне меткі этапа',
        ],
    ],
    'event' => 'Этап',
    'person' => [
        'create_button' => 'Дадаць асобу',
        'create_title' => 'Даданне асобы',
        'edit_title' => 'Рэдагаванне асобы',
    ],
];
