<?php

return [
    'club' => [
        'name' => 'Клуб',
    ],
    'persons' => [
        'title' => 'Члены федерации',
    ],
    'navbar' => [
        'clubs' => 'Клубы',
        'persons' => 'Члены федерации',
        'competitions' => 'Соревнования',
        'no-ident' => 'Не идентифицированные записи протоколов',
    ],
    'ident' => [
        'edit' => [
            'title' => 'Привязать результат к спортсмену',
        ]
    ],
    'common' => [
        'name' => 'Имя',
        'lastname' => 'Фамилия',
        'birthday' => 'Дата рождения',
    ],
    'protocol' => 'Протокол',
    'protocol-hint' => 'Калі не дабаўляць файл, то обнаўленне удзельнікаў ня будзе',
    'lang' => [
        'ru' => 'Рус',
        'by' => 'Бел',
    ]
];
