<?php

return [
    'club' => [
        'name' => 'Клуб',
    ],
    'navbar' => [
        'clubs' => 'Клубы',
        'persons' => 'Члены федерации',
        'competitions' => 'Соревнования',
        'no-ident' => 'Не идентифицированные записи протоколов',
        'flags' => 'Метки этапов',
    ],
    'ident' => [
        'edit' => [
            'title' => 'Привязать результат к спортсмену',
        ]
    ],
    'common' => [
        'name' => 'Имя',
        'lastname' => 'Фамилия',
        'birthday' => 'Дата рождения',
        'create' => 'Создать',
        'new' => 'Добавить',
        'delete' => 'Удалить',
        'update' => 'Обновить',
        'cancel' => 'Отмена',
        'add_flags' => 'Редактировать метки',
        'edit_event' => 'Редактирование этапа',
        'title' => 'Название',
        'description' => 'Описание',
        'edit' => 'Редактировать',
        'back' => 'Назад',
        'date' => 'Дата',
        'dates' => 'Даты',
        'competitors' => 'Число участников',
        'group' => 'Группа',
        'result' => 'Результат',
        'place' => 'Место',
        'points' => 'Очки',
        'complete_rank' => 'Выполненный разряд',
    ],
    'events' => [
        'flags' => 'Метки'
    ],
    'protocol' => 'Протокол',
    'competition' => 'Соревнование',
    'add_competition' => 'Добавить соревнование',
    'protocol-hint' => 'Если не добавлять файл, то обнаўления участников не будет',
    'event' => 'Этап',
    'lang' => [
        'ru' => 'Рус',
        'by' => 'Бел',
    ],
    'flags' => [
        'add_flags_title' => 'Редактировать метки этапа',
        'name' => 'Название',
        'color' => 'Цвет',
        'create' => [
            'title' => 'Добавление новой метки этапа',
        ],
        'edit' => [
            'title' => 'Редактирование метки этапа',
        ],
    ],
    'person' => [
        'title' => 'Члены федерации',
        'create_button' => 'Добавить человека',
        'create_title' => 'ДОбавление человека',
    ],
];
